obsfeil/F28379D_Robot_CCS_12.7.1/UART_Segbot4.c
// cpu_timer1_isr - CPU Timer1 ISR
__interrupt void cpu_timer1_isr(void)
{

    CpuTimer1.InterruptCount++;
}

// cpu_timer2_isr CPU Timer2 ISR
__interrupt void cpu_timer2_isr(void)
{

    UARTPrint2 = 1; //every 200 ms

    CpuTimer2.InterruptCount++;

}

// This function is called each time a char is recieved over UARTA.
void serialRXA(serial_t *s, char data) {
    numRXA ++;
}

char sendback[10];
char past[14];
void serialRXC(serial_t *s, char data) {
//    sendback[0] = data;
//    serial_send(&SerialA, sendback, 1); //every character that comes into BT will be echoed to Tera Term

    //save past states
    past[0] = past[1];
    past[1] = past[2];
    past[2] = past[3];
    past[3] = past[4];
    past[4] = past[5];
    past[5] = past[6];
    past[6] = past[7];
    past[7] = past[8];
    past[8] = past[9];
    past[9] = past[10];
    past[10] = past[11];
    past[11] = past[12];
    past[12] = past[13];
    past[13] = data;

    if(steeroff == 0){
        //use phone accelerometer data to steer
        if((past[0] == '!')&&(past[1] == 'A')){
            //incoming accelerometer data (arbitrary start point 0)

            //float is a 32-bit value (4x8-bit)
            //mantissa*2^exp where mantissa takes ~upper 21 bits and ~lower 10 is exponent
            //meaning it is not a standard ascii
            //create a union
            //there will be six 16-bit ints that make up 3 floats
            //for a union, takes up same place in memory
            //float comes over in 4 8 bit chunks

            //X
            phoneaccel.rawdata[0] = (past[3]<<8)|past[2];
            phoneaccel.rawdata[1] = (past[5]<<8)|past[4];
            //Y
            phoneaccel.rawdata[2] = (past[7]<<8)|past[6];
            phoneaccel.rawdata[3] = (past[9]<<8)|past[8];
            //Z
            phoneaccel.rawdata[4] = (past[11]<<8)|past[10];
            phoneaccel.rawdata[5] = (past[13]<<8)|past[12];

            ble_x = phoneaccel.fltdata[0];
            ble_y = phoneaccel.fltdata[1];
            ble_z = phoneaccel.fltdata[2];

            //Interpret phone accel data as steering instructions
            if(ble_y >= 0.3){
                //turn left
    //            turnrate = -2.0;
                turnrate = -4.0;
            }else if(ble_y <= -0.3){
                //turn right
    //            turnrate = 2.0;
                turnrate = 4.0;
            }else if(fabs(ble_y) < 0.3){
                //don't turn
                turnrate = 0;
            }

            if(ble_z <= -0.3){
                //go forward
                FwdBackOffset = -1.0;
            }else if(ble_z >= 0.3){
                //go backward
                FwdBackOffset = 1.0;
            }else if(fabs(ble_z) < 0.3){
                //don't go forward or backward
                FwdBackOffset = 0;
            }

            UARTPrint = 1;
        }
    }

}

__interrupt void ADCA_ISR(void){
        adca0result = AdcaResultRegs.ADCRESULT0; //read ADC values
        adca1result = AdcaResultRegs.ADCRESULT1;

        // Here covert ADCIND0, ADCIND1 to volts
        adca0_volts = adca0result/1365.0;
        adca1_volts = adca1result/1365.0;

        //SPI Read Gyros and Accelerometers

        GpioDataRegs.GPCCLEAR.bit.GPIO66 = 1; // Slave Select Low
        SpibRegs.SPIFFRX.bit.RXFFIL = 8; // Issue the SPIB_RX_INT when two values are in the RX FIFO

        //write to TXBUF
        SpibRegs.SPITXBUF = 0x8000|0x3A00; //start address (one register before accel)
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read ACCEL_XOUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read ACCEL_YOUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read ACCEL_ZOUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read TEMP_OUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read GYRO_XOUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read GYRO_YOUT
        SpibRegs.SPITXBUF = 0x0000; //write 0x00 to read GYRO_ZOUT

        AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;  //clear interrupt flag
        PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

__interrupt void SPIB_isr(void){

    //read from RX FIFO
    Junk = SpibRegs.SPIRXBUF; //garbage value read
    accelxraw = SpibRegs.SPIRXBUF;
    accelyraw = SpibRegs.SPIRXBUF;
    accelzraw = SpibRegs.SPIRXBUF;
    Junk = SpibRegs.SPIRXBUF;
    gyroxraw = SpibRegs.SPIRXBUF;
    gyroyraw = SpibRegs.SPIRXBUF;
    gyrozraw = SpibRegs.SPIRXBUF;

    GpioDataRegs.GPCSET.bit.GPIO66 = 1; // Slave Select High

    accelx = (float)(accelxraw*4.0/32767.0); // m/s2, this value is saturated due to offset
    accely = (float)(accelyraw*4.0/32767.0); // m/s2
    accelz = (float)(accelzraw*4.0/32767.0); // m/s2
    gyrox = (float)(gyroxraw*250.0/32767.0); //deg per second
    gyroy = (float)(gyroyraw*250.0/32767.0); //deg per second
    gyroz = (float)(gyrozraw*250.0/32767.0); //deg per second

    //Code to be copied into SPIB_ISR interrupt function after the IMU measurements have been collected.
      if(calibration_state == 0){
            calibration_count++;
            if (calibration_count == 2000) {
                calibration_state = 1;
                calibration_count = 0;
            }
        } else if(calibration_state == 1){
            accelx_offset+=accelx;
            accely_offset+=accely;
            accelz_offset+=accelz;
            gyrox_offset+=gyrox;
            gyroy_offset+=gyroy;
            gyroz_offset+=gyroz;
            calibration_count++;
            if (calibration_count == 2000) {
                calibration_state = 2;
                accelx_offset/=2000.0;
                accely_offset/=2000.0;
                accelz_offset/=2000.0;
                gyrox_offset/=2000.0;
                gyroy_offset/=2000.0;
                gyroz_offset/=2000.0;
                calibration_count = 0;
                doneCal = 1;
            }

        } else if(calibration_state == 2){

            accelx -=(accelx_offset);
            accely -=(accely_offset);
            accelz -=(accelz_offset-accelzBalancePoint);
            gyrox -= gyrox_offset;
            gyroy -= gyroy_offset;
            gyroz -= gyroz_offset;

            /*--------------Kalman Filtering code start---------------------------------------------------------------------*/
            float tiltrate = (gyrox*PI)/180.0; // rad/s
            float pred_tilt, z, y, S;

